// 1) Створіть порожній масив;
// До першого елемента масиву запишіть будь-яке число;
// У другий елемент масиву запишіть будь-який рядок;
// До третього елементу масиву запишіть будь-яке логічне значення;
// У четвертому елементі масиву запишіть значення null;
// Виведіть на екран число елементів, що зберігається у масиві;
// Запишіть значення в п'ятий елемент масиву;
// Виведіть у консоль п'ятий елемент масиву.

// 2) Дано чотири цілих числа, одне з яких відрізняється від трьох інших, рівних між собою. Визначте порядковий номер числа, відмінного від інших.

// 3) Реализуй симуляцию куба (тоесть трехмерный массив) длиной 3 и выведи значение которое находиться в середине куба



// let a = [5, "stroka", true, null, 9];
// console.log(a.length);
// console.log(a[4]);




let b = [2, 3, 3, 3]; 
let res = 0;
if(b[0] != b[1]){
    if(b[1] == b[2]){
    console.log(res);
    } else if(b[0] == b[3]){
        console.log(res + 1);
    }
} else if(b[0] != b[2]) {
    console.log(res + 2);
} else if(b[0] != b[3]) {
    console.log(res + 3);
} 
let k = 0;



// let a = [[1, 3, 6], [2, 5 ,7], [3, 7, 9]];
// console.log(a[1][1])